def xor(x,y):
    if x + y ==2 or x+y==0:
        print(0)
    else: print(1)
a, p= list(map(float,input().split()))
xor(a,p)
"""
Входные данные
Вводятся целые числа a и b. Гарантируется, что a не превосходит b

Выходные данные
Выведите (через пробел) все четные числа от a до b (включительно).

"""