x=input()
d=input()
cnt=0
for i in x:
    if i==d:
        cnt+=1
print(cnt)
'''
Входные данные
Вводятся 2 числа: x и d.

Выходные данные
Подсчитайте и выведите одно число - сколько раз встречается в записи натурального числа x цифра d.

'''