x=input()
sum=0;
for i in x:
    sum+=int(i)
print(sum)
'''
Входные данные
Вводится натуральное число x.

Выходные данные
Выведите сумму цифр числа x.

'''