x=int(input())
for i in range(1,x+1):
    if x%i==0:
        print(i)
'''
Входные данные
Вводится натуральное число x

Выходные данные
Выведите все делители числа x

'''