n=int(input())
sum=0
for i in range(n):
    x=int(input())
    sum+=x
print(sum)
'''
Входные данные
Вводится число N, а затем N чисел, сумму которых необходимо вычислить.

Выходные данные
Выведите единственное число - сумму введенных чисел.

'''